<a href="https://colab.research.google.com/github/jeffheaton/t81_558_deep_learning/blob/master/t81_558_class_02_3_pandas_grouping.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# T81-558: Applications of Deep Neural Networks
**Module 2: Python for Machine Learning**
* Instructor: [Jeff Heaton](https://sites.wustl.edu/jeffheaton/), McKelvey School of Engineering, [Washington University in St. Louis](https://engineering.wustl.edu/Programs/Pages/default.aspx)
* For more information visit the [class website](https://sites.wustl.edu/jeffheaton/t81-558/).

# Module 2 Material

Main video lecture:

* Part 2.1: Introduction to Pandas [[Video]](https://www.youtube.com/watch?v=bN4UuCBdpZc&list=PLjy4p-07OYzulelvJ5KVaT2pDlxivl_BN) [[Notebook]](t81_558_class_02_1_python_pandas.ipynb)
* Part 2.2: Categorical Values [[Video]](https://www.youtube.com/watch?v=4a1odDpG0Ho&list=PLjy4p-07OYzulelvJ5KVaT2pDlxivl_BN) [[Notebook]](t81_558_class_02_2_pandas_cat.ipynb)
* **Part 2.3: Grouping, Sorting, and Shuffling in Python Pandas** [[Video]](https://www.youtube.com/watch?v=YS4wm5gD8DM&list=PLjy4p-07OYzulelvJ5KVaT2pDlxivl_BN) [[Notebook]](t81_558_class_02_3_pandas_grouping.ipynb)
* Part 2.4: Using Apply and Map in Pandas for Keras [[Video]](https://www.youtube.com/watch?v=XNCEZ4WaPBY&list=PLjy4p-07OYzulelvJ5KVaT2pDlxivl_BN) [[Notebook]](t81_558_class_02_4_pandas_functional.ipynb)
* Part 2.5: Feature Engineering in Pandas for Deep Learning in Keras [[Video]](https://www.youtube.com/watch?v=BWPTj4_Mi9E&list=PLjy4p-07OYzulelvJ5KVaT2pDlxivl_BN) [[Notebook]](t81_558_class_02_5_pandas_features.ipynb)

# Google CoLab Instructions

The following code ensures that Google CoLab is running the correct version of TensorFlow.

In [1]:
try:
    %tensorflow_version 2.x
    COLAB = True
    print("Note: using Google CoLab")
except:
    print("Note: not using Google CoLab")
    COLAB = False

Note: not using Google CoLab

# Part 2.3: Grouping, Sorting, and Shuffling  

Now we will take a look at a few ways to affect an entire Pandas data frame.  These techniques will allow us to group, sort, and shuffle data sets.  These are all essential operations for both data preprocessing and evaluation.

### Shuffling a Dataset
There may be information lurking in the order of the rows of your dataset.  Unless you are dealing with time-series data, the order of the rows should not be significant.  Consider if your training set included employees in a company.  Perhaps this dataset is ordered by the number of years that the employees were with the company.  It is okay to have an individual column that specifies years of service.  However, having the data in this order might be problematic.  

Consider if you were to split the data into training and validation.  You could end up with your validation set having only the newer employees and the training set longer-term employees.  Separating the data into a k-fold cross validation could have similar problems.  Because of these issues, it is important to shuffle the data set.

Often shuffling and reindexing are both performed together.  Shuffling randomizes the order of the data set.  However, it does not change the Pandas row numbers.  The following code demonstrates a reshuffle.  Notice that the first column, the row indexes, has not been reset.  Generally, this will not cause any issues and allows trace back to the original order of the data.  However, I usually prefer to reset this index. I reason that I typically do not care about the initial position, and there are a few instances where this unordered index can cause issues.

In [4]:
import os
import pandas as pd
import numpy as np

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", 
    na_values=['NA', '?'])
display(df)
#np.random.seed(42) # Uncomment this line to get the same shuffle each time
#https://www.w3schools.com/python/numpy_random_permutation.asp
print('df.index => ',df.index,'\n')
idx = np.random.permutation(df.index)
print('np.random.permutation(df.index) => ',idx,'\n')
df = df.reindex(idx)
#Conform Series/DataFrame to new index 
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
0,18.0,8,307.0,...,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,...,70,1,buick skylark 320
...,...,...,...,...,...,...,...
396,28.0,4,120.0,...,82,1,ford ranger
397,31.0,4,119.0,...,82,1,chevy s-10

df.index =>  RangeIndex(start=0, stop=398, step=1)

np.random.permutation(df.index) =>  [216  78 131 336 233 348 179 114 367  91 116 104   3 207 364 318  44 171
  50   6 107  18 154 183 365 356 122 208 390 251  21 294 101 160 165 174
  15 389 363  86 305 139 217 190 238 120  20 204 299  64 274  36  51  35
  28 186 252 379  45  70 151 188 153 306  62 285 312 125 227 270 303 282
  32 239  54 242 338 329 209 146 113   7 196 135 369  61 236 168  69 234
  29 250 182  30 220  37 224 200 229 167  92 145 205 370 359 187  83 219
 292 192 255 391  46 344  13   5 280 193  10  77 127  72  63 141  88   1
  39 293 128 166 246 278 112 298 313  19 307 373 372 230 215  93  43  75
 143 381 173 231 311 140 184 152 321 157 110 339 393 191 176 272 123  23
 163 376 111 289 266 103 368 355 392 271  79 261 164 328 269  40  84 201
 309 100 301  96 118 287   4 353  53 241 147 177  22 279 121 347 341  94
  12  68  67 284 320 228 345  34  95 334 395 383 296 385 315  17 324 222
 130 361 206 162  87 194  56 159 326  31 384 358 265 221  41 189 297   2
 286 288 198  38 172  27 237 142 134 319 161 226 275 357 249 264 349 254
  65  89 213 310 106 387 377 169 170  74 260 397 375 332  85 235  58 371
 327 225 178 343 214  82  97 342 244  16 138 362  66 210 308 158 117 262
 295 218 352 259 281  26 267  76 240 144  52 109 337 290  59   9  57 180
 276 386 340 360 346 232 199 129 115 197 256 212 331  11  73 316 148 155
  49 304 268  48 283 211  90 258 105 351 133 366 137 380 378 132 102 136
  14 248 124 150 388 203 314 245 243 382 291 396 330 322 181  71 317 149
 300  24  99 257  60 185 354 195 223 175 325 323 108 374 277 253 333 156
  47 394  55  33  80 302  98  25 247  42 350 335  81   8 273 126 119 202
 263   0]

,mpg,cylinders,displacement,...,year,origin,name
216,31.5,4,98.0,...,77,3,honda accord cvcc
78,21.0,4,120.0,...,72,2,peugeot 504 (sw)
...,...,...,...,...,...,...,...
263,17.7,6,231.0,...,78,1,buick regal sport coupe (turbo)
0,18.0,8,307.0,...,70,1,chevrolet chevelle malibu

The following code demonstrates a reindex.  Notice how the reindex orders the row indexes.

In [5]:
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)
#Reset the index of the DataFrame, and use the default one instead.
df.reset_index(inplace=True, drop=True)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
0,31.5,4,98.0,...,77,3,honda accord cvcc
1,21.0,4,120.0,...,72,2,peugeot 504 (sw)
...,...,...,...,...,...,...,...
396,17.7,6,231.0,...,78,1,buick regal sport coupe (turbo)
397,18.0,8,307.0,...,70,1,chevrolet chevelle malibu

### Sorting a Data Set

While it is always a good idea to shuffle a data set before training, during training and preprocessing, you may also wish to sort the data set.  Sorting the data set allows you to order the rows in either ascending or descending order for one or more columns. The following code sorts the MPG dataset by name and displays the first car.

In [1]:
import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", 
    na_values=['NA', '?'])

df = df.sort_values(by='name', ascending=True)
print(f"The first car is: {df['name'].iloc[0]}")
      
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)
display(df)

The first car is: amc ambassador brougham

      mpg  cylinders  displacement  ...  year  origin                     name
96   13.0          8         360.0  ...    73       1  amc ambassador brougham
9    15.0          8         390.0  ...    70       1       amc ambassador dpl
..    ...        ...           ...  ...   ...     ...                      ...
325  44.3          4          90.0  ...    80       2     vw rabbit c (diesel)
293  31.9          4          89.0  ...    79       2         vw rabbit custom

[398 rows x 9 columns]

### Grouping a Data Set

Grouping is a typical operation on data sets.  Structured Query Language (SQL) calls this operation a "GROUP BY."  Programmers use grouping to summarize data.  Because of this, the summarization row count will usually shrink, and you cannot undo the grouping.  Because of this loss of information, it is essential to keep your original data before the grouping. 

The Auto MPG dataset is used to demonstrate grouping.

In [2]:
import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", 
    na_values=['NA', '?'])

pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
0,18.0,8,307.0,...,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,...,70,1,buick skylark 320
...,...,...,...,...,...,...,...
396,28.0,4,120.0,...,82,1,ford ranger
397,31.0,4,119.0,...,82,1,chevy s-10

The above data set can be used with the group to perform summaries.  For example, the following code will group cylinders by the average (mean).  This code will provide the grouping.  In addition to **mean**, you can use other aggregating functions, such as **sum** or **count**.

In [6]:
g = df.groupby('cylinders')['mpg'].mean()
g

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

It might be useful to have these **mean** values as a dictionary.

In [7]:
d = g.to_dict()
d

{3: 20.55,
 4: 29.28676470588236,
 5: 27.366666666666664,
 6: 19.985714285714284,
 8: 14.963106796116508}

A dictionary allows you to access an individual element quickly.  For example, you could quickly look up the mean for six-cylinder cars.  You will see that target encoding, introduced later in this module, makes use of this technique.

In [8]:
d[6]

19.985714285714284

The code below shows how to count the number of rows that match each cylinder count.

In [9]:
df.groupby('cylinders')['mpg'].count().to_dict()

{3: 4, 4: 204, 5: 3, 6: 84, 8: 103}